app/Http/Controllers/Api/ArticleController.php

update `states` set `views` = `views` + 1 where `id` = 20
---
    public function viewsIncrement(Request $request) {
        $article = $this->service->getArticleBySlug($request);

        $article->state->increment('views');